In [8]:
import pandas as pd

### min and max

In [9]:
data = {
    'Name': ['John', 'Emily', 'David', 'Sarah'],
    'Age': [25, 30, 20, 28],
    'Height': [175, 160, 180, 165]
}

df = pd.DataFrame(data)
df

    Name  Age  Height
0   John   25     175
1  Emily   30     160
2  David   20     180
3  Sarah   28     165

### df.col.min()

### df.col.max()

In [10]:
# Find the maximum and minimum values of the 'Age' column
max_age = df['Age'].max()
min_age = df['Age'].min()

print("Maximum Age:", max_age)
print("Minimum Age:", min_age)

Maximum Age: 30
Minimum Age: 20

### clip
- Used to limit the values in a DataFrame or Series to a specified range. Values below the lower bound are set to the lower bound, and values above the upper bound are set to the upper bound.

### df.col.clip(startrange,endrange) => both inclusive

In [11]:
data = {
    'Temperature': [35, 28, 40, 32, 42, 25]
}

df = pd.DataFrame(data)
df

   Temperature
0           35
1           28
2           40
3           32
4           42
5           25

In [12]:
# Clip the temperature values to a range of 30 to 40
df['Temperature'] = df['Temperature'].clip(30, 40)
df

   Temperature
0           35
1           30
2           40
3           32
4           40
5           30

### df.col.abs()

In [13]:
data = {
    'Number': [-5, 10, -15, 20]
}

df = pd.DataFrame(data)
df

   Number
0      -5
1      10
2     -15
3      20

In [14]:
# Calculate the absolute values of the 'Number' column
df['Absolute'] = df['Number'].abs()
df

   Number  Absolute
0      -5         5
1      10        10
2     -15        15
3      20        20